## Adam Pithenwala

23/01/2023

In [3]:
import pandas as pd
import numpy as np

In [4]:
print(dir(pd))

['ArrowDtype', 'BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__deprecated_num_index_names', '__dir__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_is_numpy_dev', '_libs', '_testing', '_typing', '_version', 'annotations', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'from_dummies', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

### String in python is termed as object in pandas

In [12]:

ser = pd.Series([10,20,40,80,90,100,'64'])
print(ser)

0     10
1     20
2     40
3     80
4     90
5    100
6     64
dtype: object

In [11]:
dict = {'A':[2,4,6],'B':[1,3,9],'C':[4,6,8]}
print(dict)

{'A': [2, 4, 6], 'B': [1, 3, 9], 'C': [4, 6, 8]}

### Converting to Dataframe

In [15]:
df = pd.DataFrame(dict)
df

   A  B  C
0  2  1  4
1  4  3  6
2  6  9  8

### Adding more columns to dataframe

In [19]:
df['D']= "one two three".split()
df

   A  B  C      D
0  2  1  4    one
1  4  3  6    two
2  6  9  8  three

In [29]:
df['E'] = [20, 25, 30]
df

   A  B  C      D   E   e
0  2  1  4    one  20  20
1  4  3  6    two  25  25
2  6  9  8  three  30  30

### Deleting an column

In [30]:
df.drop(['e'],axis=1,inplace=True)

In [32]:
dict1 = {'A':[3,np.nan,np.nan],'B':[4,6,np.nan],'C':[2,5,9],'D':[60,80,100]}
dict1

{'A': [3, nan, nan], 'B': [4, 6, nan], 'C': [2, 5, 9], 'D': [60, 80, 100]}

In [34]:
df1 = pd.DataFrame(dict1)
df1

     A    B  C    D
0  3.0  4.0  2   60
1  NaN  6.0  5   80
2  NaN  NaN  9  100

In [36]:
print(df1.dropna())

     A    B  C   D
0  3.0  4.0  2  60

In [37]:
print(df1.dropna(axis=1))

   C    D
0  2   60
1  5   80
2  9  100

In [39]:
print(df1.fillna(value=32))

      A     B  C    D
0   3.0   4.0  2   60
1  32.0   6.0  5   80
2  32.0  32.0  9  100

In [45]:
df1.fillna(value=df1['C'].mean())

          A         B  C    D
0  3.000000  4.000000  2   60
1  5.333333  6.000000  5   80
2  5.333333  5.333333  9  100

In [46]:
df1

     A    B  C    D
0  3.0  4.0  2   60
1  NaN  6.0  5   80
2  NaN  NaN  9  100

In [50]:
print(df1.fillna(value=df1['C'].mean(),inplace=True))
df1

None

          A         B  C    D
0  3.000000  4.000000  2   60
1  5.333333  6.000000  5   80
2  5.333333  5.333333  9  100

### Groupby

In [51]:
data = {
    "Company": ["Infosys", "TCS", "Amazon", "JP Morgan", "TCS", "Infosys", "Amazon"],
    "Person": ["Adam", "Adivya", "Ram", "Jayesh", "Harsh", "Amey", "Payal"],
    "Sales": [120, 200, 500, 400, 600, 800, 700],
    "Profit": [20, 15, 78, 64, 12, 19, 45],
}
data

{'Company': ['Infosys',
  'TCS',
  'Amazon',
  'JP Morgan',
  'TCS',
  'Infosys',
  'Amazon'],
 'Person': ['Adam', 'Adivya', 'Ram', 'Jayesh', 'Harsh', 'Amey', 'Payal'],
 'Sales': [120, 200, 500, 400, 600, 800, 700],
 'Profit': [20, 15, 78, 64, 12, 19, 45]}

In [54]:
df2 = pd.DataFrame(data)
df2

     Company  Person  Sales  Profit
0    Infosys    Adam    120      20
1        TCS  Adivya    200      15
2     Amazon     Ram    500      78
3  JP Morgan  Jayesh    400      64
4        TCS   Harsh    600      12
5    Infosys    Amey    800      19
6     Amazon   Payal    700      45

In [60]:
print(df2.groupby('Company')['Sales'].mean())

Company
Amazon       600.0
Infosys      460.0
JP Morgan    400.0
TCS          400.0
Name: Sales, dtype: float64

In [61]:
print(df2.groupby('Company')['Profit'].mean())

Company
Amazon       61.5
Infosys      19.5
JP Morgan    64.0
TCS          13.5
Name: Profit, dtype: float64

In [62]:
print(df2.groupby('Company'))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fae82b3be50>

In [65]:
idj = pd.DataFrame(df2.groupby('Company'))
idj

           0                                                  1
0     Amazon    Company Person  Sales  Profit
2  Amazon    R...
1    Infosys     Company Person  Sales  Profit
0  Infosys   ...
2  JP Morgan       Company  Person  Sales  Profit
3  JP Morg...
3        TCS    Company  Person  Sales  Profit
1     TCS  Ad...